backend/controllers/AdminuserController.php

SELECT `name`, `description` FROM `auth_item` WHERE `type`=1 ORDER BY `description`
SELECT `item_name` FROM `auth_assignment` WHERE `user_id`='20' ORDER BY `item_name`
---
    public function actionPrivilege($id)
    {
        //step1. 找出所有权限,提供给checkboxlist
        $allPrivileges = AuthItem::find()->select(['name','description'])->where
        (['type'=>1])->orderBy('description')->all();

        foreach($allPrivileges as $pri)
        {
            $allPrivilegesArray[$pri->name]=$pri->description;
        }

        //step2. 当前用户的权限
        $AuthAssignments = AuthAssignment::find()->select(['item_name'])->where(['user_id'=>$id])->orderBy('item_name')->all();