backend/controllers/PostController.php

    public function actionCreate()
    {
        if(!Yii::$app->user->can('createPost')){
            throw new ForbiddenHttpException('对不起，你没有进行该操作的权限。');
        }

        $model = new Post();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `post` (`title`, `content`, `tags`, `status`, `author_id`, `create_time`, `update_time`) VALUES ('test', 'a test post', '', 2, 18, 1521465688, 1521465688)