backend/views/adminuser/privilege.php

/* @var $this yii\web\View */
/* @var $model common\models\Adminuser */

$model = Adminuser::findOne($id);
---
SELECT * FROM `adminuser` WHERE `id`='20'