frontend/controllers/PostController.php

SELECT MAX(update_time) FROM `post`
---
    public function behaviors()
    {
        return [
            'verbs' => [
                'class' => VerbFilter::className(),
                'actions' => [
                    'delete' => ['POST'],
                ],
            ],
            //页面缓存设置
            'pageCache'=>[
                'class' => 'yii\filters\PageCache',
                'only' => ['index'],
                'duration' => 600,
                'variations' => [
                    \Yii::$app->request->get('page'),
                    \Yii::$app->request->get('PostSearch'),
                ],
                'dependency' => [
                    'class' => 'yii\caching\DbDependency',
                    'sql' => 'SELECT COUNT(id) FROM post',
                ],
            ],
            //http缓存设置
            'httpCache'=>[
                'class' => 'yii\filters\HttpCache',
                'only' => ['detail'],
                'lastModified' => function ($action, $params) {
                    $q = new \yii\db\Query();
                    return $q->from('post')->max('update_time');

SELECT * FROM `user` WHERE `id`=3
---
    public function actionDetail($id)
    {
        //第一步：准备数据模型
        $model = $this->findModel($id);
        $tags = Tag::findTagWeights();
        $recentComments = Comment::findRecentComments();


        if(Yii::$app->user->id){
            //登录用户的情况
            $userMe = User::findone(Yii::$app->user->id);//Yii::$app->user->id是登录用户user的id。