backend/views/post/_form.php

SELECT `name`, `id` FROM `poststatus` ORDER BY `position`
SELECT `nickname`, `id` FROM `adminuser`
---
    ->column();
    */
    //第四种方法
     $allStatus = Poststatus::find()
    ->select(['name','id'])
    ->orderBy('position')
    ->indexBy('id')
    ->column();
	?>

    <?= $form->field($model, 'status')
		->dropDownList(Poststatus::find()
                        ->select(['name','id'])
                        ->orderBy('position')
                        ->indexBy('id')
                        ->column(),
		['prompt'=>'请选择状态']); ?>


    <?= $form->field($model, 'author_id')
        ->dropDownList(Adminuser::find()
                        ->select(['nickname','id'])
                        ->indexBy('id')
                        ->column(),
        ['prompt'=>'请选择作者']); ?>