backend/views/comment/_form.php

SELECT `name`, `id` FROM `poststatus` ORDER BY `position`
---

    <?= $form->field($model, 'content')->textarea(['rows' => 6]) ?>

    <?= $form->field($model, 'status')
    ->dropDownList(Poststatus::find()
                        ->select(['name','id'])
                        ->orderBy('position')
                        ->indexBy('id')
                        ->column(),
        ['prompt'=>'请选择状态']);