common/models/Adminuser.php

    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id]);
---
SELECT * FROM `adminuser` WHERE `id`=20