common/models/Comment.php

SELECT COUNT(*) FROM `comment` WHERE `status`=1
---
    public static function getPengdingComment()
    {
        return Comment::find()->where(['status'=>1])->count();

SELECT * FROM `comment` WHERE `status`=2 ORDER BY `create_time` DESC LIMIT 10
---
    public static function findRecentComments($limit=10)
    {
        return Comment::find()->where(['status'=>2])->orderBy('create_time desc')->limit($limit)->all();