common/models/Post.php

SELECT COUNT(*) FROM `comment` WHERE (`post_id`=35) AND (`status`=2)
---
    public function getCommentCount()
    {
        return Comment::find()->where(['post_id'=>$this->id,'status'=>2])->count();